Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/dismissal/fair_grounds_for_dismissal.html.txt.tmx
Source language: en
Languages: ga

source: Fair grounds for dismissal
ga: Cúiseanna maithe le dífhostú

source: If you are dismissed from your employment you may, under certain conditions, bring a claim for unfair dismissal against your employer
ga: Má dhífhostaítear tú, is féidir leat éileamh maidir le dífhostú éagórach a dhéanamh i gcoinne d'fhostóra, faoi réir coinníollacha áirithe

source: Apart from a case involving constructive dismissal a dismissal is presumed to be unfair unless your employer can show substantial grounds to justify it
ga: Seachas cás ina bhfuil dífhostú inchiallaithe i gceist, glactar leis go bhfuil dífhostú éagórach mura bhfuil ar chumas an fhostóra a léiriú go bhfuil cúiseanna maithe ag baint leis

source: So if you qualify to bring a claim and there was a dismissal, your employer has to prove that the dismissal was a fair one, that is, that there were fair grounds for the dismissal and that fair procedures were followed
ga: Mar sin de, má bhí dífhostú ann agus má tá tú i dteideal éileamh a dhéanamh, caithfidh an fostóir a chruthú gur dífhostú cóir a bhí ann .i. go raibh cúiseanna maithe leis an dífhostú agus gur cloíodh leis na nósanna imeachta cearta:

source: If you are dismissed from your job you are entitled to a statutory minimum period of notice if you have worked at least 13 weeks for your employer
ga: Má dhífhostaítear tú ó do phost, tá fógra íosthréimhse reachtúil ag dul do gach fostaí atá fostaithe ag a f(h)ostóir ar feadh 13 sheachtain ar a laghad

source: Your written contract of employment may provide for a longer period of notice
ga: D'fhéadfadh do chonradh oibre foráil a dhéanamh i gcomhair fógra tréimhse níos faide

source: Under the unfair dismissals legislation you may ask your employer for a written statement of the reasons for your dismissal
ga: Faoin reachtaíocht, tá sé de cheart agat ráiteas scríofa a iarraidh ó d'fhostóir ag léiriú cúiseanna an dífhostaithe

source: Your employer should provide this within 14 days of your request
ga: Ba chóir don bhfostóir é seo a chur ar fáil laistigh de 14 lá

source: In order to justify the dismissal your employer:
ga: Le dífhostú a chruthú ní mór don bhfostóir:

source: • Must show that your dismissal was connected with one or more of the potentially fair grounds set out in the legislation
ga: • A léiriú go raibh baint ag an dífhostú le ceann nó níos mó de na cúiseanna atá leagtha síos sa reachtaíocht

source: • Must show that fair procedures were followed and must have acted fairly
ga: • A léiriú gur cloíodh leis na nósanna imeachta cearta agus gur iompair sé/sí é/í féin mar ba cheart

source: • Will have to disprove any allegation by you that your case involves any of the automatically unfair reasons for dismissal
ga: • A bheith in ann a bhréagnú go bhfuil baint ag aon líomhain a dhéanann tusa leis na cúiseanna éagóracha le dífhostú sa ghnáthchúrsa

source: Your employer could give one or more of the following reasons for your dismissal:
ga: D'fhéadfadh d'fhostóir cúis amháin nó níos mó ón liosta seo thíos a thabhairt mar chúis leis an dífhostú:

source: This includes issues such as lateness, absenteeism and persistent absence through illness or injury, either short-term or long-term
ga: Clúdaíonn sé sin cúiseanna ar nós déanacht, neamhláithreacht agus neamhláithreacht leanúnach mar gheall ar thinneas nó ghortú, cibé gearrthéarmach nó fadthéarmach

source: If lateness or absenteeism is at issue, your employer will be expected to have documentary proof of this allegation, such as clocking-in records or documented absences on file that are not medically certified
ga: Má tá déanacht nó neamhláithreacht i gceist, ba cheart cruthúnas faisnéisneach a bheith ag d'fhostóir, ar nós taifid chlogála isteach nó cruthúnas neamhláithreachta agus iad gan deimhniú dochtúra a bheith leo

source: In addition, your employer will also be expected to show that you were made aware of the problem and that you were warned as to the consequences for your continued employment
ga: Ina theannta sin, beifear ag súil go mbeidh an fostóir in ann cruthúnas a thabhairt gur chuir sé/sí an fhadhb in iúl duit agus gur tugadh foláireamh duit maidir leis an tionchar a bheadh aici ar bhuanú d'fhostaíochta

source: If illness or injury is at issue, it is often assumed that you cannot be dismissed fairly while on certified sick leave from your work
ga: Má tá breoiteacht nó gortú i gceist, meastar go minic nach féidir duine a dhífhostú go cóir agus é/í ar shaoire bhreoiteachta óna (h)obair

source: However, this is not true
ga: Níl sé sin fíor, áfach

source: It is difficult to lay down hard and fast rules to apply to these cases as each will be treated on its own merits
ga: Is deacair rialacha dochta daingne a leagan síos maidir leis na cásanna seo mar measfar gach ceann acu ar a fhiúntas féin

source: Issues such as length of service, previous record and the importance of the job will vary and will have to be taken into account
ga: Beidh éagsúlacht i ngach cás, mar shampla faid sheirbhíse, do thaifead oibre roimhe seo agus tábhacht na fostaíochta

source: These types of claim are often divided into short-term and long-term absences
ga: Roinntear an cineál éileamh seo go minic i neamhláithreacht ghearrthéarmach agus neamhláithreacht fhadtéarmach

source: Dismissal related to short-term illness generally occurs where you have a medical problem that results in frequent absences for short periods from the workplace
ga: Tarlaíonn dífhostú maidir le breoiteacht ghearrthéarmach nuair a bhíonn tú neamhláithreach go minic mar thoradh ar fadhb sláinte a bheith ort

source: Assuming that the genuine nature of your problem was not in question, your employer will have to show that a pattern of absence exists, that it is causing problems, that the problem is unlikely to get better and that you have been warned that dismissal is likely
ga: Ag glacadh leis nach raibh aon amhras faoin bhfadhb sláinte, beidh ar an bhfostóir a thaispeáint go bhfuil pátrún neamhláithreachta i bhfeidhm agus go bhfuil sé ag cothú deacrachtaí, nach bhfuil dealramh ann go bhfeabhsóidh an fhadhb agus gur tugadh foláireamh duit gur cosúil go bhfuil dífhostú i ndán

source: In a case of a long-term absence, however, your employer will be expected to obtain detailed medical evidence that an early return to work is unlikely
ga: I gcás neamhláithreachta fadthéarmaí, áfach, beifear ag súil go bhfaighidh d'fhostóir fianaise leighis mhionchruinn ag rá nach cosúil go mbeidh tú ag filleadh ar an obair ar ball

source: There is no set period of absence by which it can be said that a dismissal will or will not be considered reasonable
ga: Níl aon tréimhse socraithe neamhláithreachta leagtha síos inar féidir a rá go bhfuil nó nach bhfuil dífhostú réasúnach

source: Obviously, the longer the absence, the easier it is for your employer to show that it is causing genuine difficulty in terms of the organisation of the workplace
ga: Dá fhad an neamhláithreacht is ea is éasca don bhfostóir a thaispeáint go bhfuil sé ag cothú fíordheacrachtaí maidir le heagraíocht na háite oibre

source: In terms of medical evidence you may be required to attend your employer's medical expert
ga: I dtéarmaí fianaise leighis d'fhéadfadh go mbeadh ort freastal ar shaineolaí leighis de chuid d'fhostóra

source: If there is a conflict of medical evidence between you and your employer as to the possible return date, your employer will be expected to get a second opinion before taking the decision to dismiss you
ga: Má tá coimhlint ó thaobh fianaise leighis idir tusa agus d'fhostóir maidir leis an dáta fillte a d'fhéadfadh a bheith ann, beifear ag súil go lorgóidh an fostóir dara tuairim sula ndéanfaidh sé an cinneadh tú a dhífhostú

source: However, it is important to note that if your illness might be considered a disability under employment equality legislation, your rights under that particular legislation would also have to be taken into consideration
ga: Áfach, is tábhachtach aire a thabhairt, dá mbreathnódh ar do thinneas mar mhíchumas faoin reachtaíocht comhionannais fostaíochta, caithfidh do chearta faoin reachtaíocht seo bheith san áireamh freisin

source: Competence refers to your ability to do your job
ga: Baineann inniúlacht le do chumas do jab a dhéanamh

source: In the first place, you need to be made aware of the standards that are expected of you, and these must refer to the job you were hired to do
ga: Ar an gcéad dul síos, beifear ag súil le caighdeáin uait agus ní mór iad sin a léiriú duit. Caithfidh go mbaineann siad leis an jab ar fostaíodh tú dó

source: Secondly, if you fall short of the required standard, this must be clearly explained to you
ga: Ar an dara dul síos, mura sroicheann tú an caighdeán riachtanach, ní mór é sin a chur in iúl duit

source: This should be done through a formal set procedure
ga: Ba chóir é sin a dhéanamh trí mheán nós imeachta foirmeálta faoi leith

source: Your employer should also specify what improvements are necessary
ga: Ba chóir don bhfostóir na feabhsúcháin riachtanacha a shonrú duit

source: These should be achievable and a reasonable timeframe must be allowed for the improvement
ga: Ba chóir dóibh siúd a bheith indéanta agus ní mór teaorainn ama réasúnta a cheadú don bhfeabhas

source: Ultimately, your employer should give you a final warning setting out the likelihood of dismissal
ga: Faoi dheireadh, ba chóir don bhfostóir rabhadh deireanach a thabhairt duit a léiríonn an dealraitheacht dífhostaithe

source: Fair dismissal on grounds of qualifications can happen in two ways
ga: Tarlaíonn dífhostú cóir mar gheall ar chúiseanna cáilíochtaí i ndá bhealach

source: One situation is where you misled your employer about qualifications you had when applying for the job
ga: Cás amháin ná nuair a chuir tú míthreoir ar an bhfostóir maidir leis na cáilíochtaí a bhí agat nuair a chuir tú isteach ar an bpost

source: The other is where your employer made continued employment conditional upon your obtaining further qualifications and you failed to achieve this, having been given a reasonable opportunity to do so
ga: An cás eile ná nuair a gheall an fostóir fostaíocht leanúnach duit ar an gcoinníoll go dtabharfá faoi cháilíochtaí breise a fháil agus theip ort an coinníoll sin a chomhlíonadh cé gur tugadh deis réasúnta duit

source: As a ground for fair dismissal the term conduct covers a very large area of behaviour
ga: Mar chúis le dífhostú cóir clúdaíonn an téarma iompar réimse leathan iompraíochta

source: There is a need to distinguish between gross misconduct and ordinary instances of misconduct
ga: Tá gá le idirdhealú a dhéanamh idir mí-iompar tromchúiseach agus gnátheachtraí mí-iompair

source: Gross misconduct may give rise to instant (summary) dismissal without notice or pay in lieu of notice
ga: D'fhéadfadh mí-iompar tromchúiseach dífhostú láithreach (achoimre) a spreagadh gan fógra nó pá in áit fógra

source: Examples of gross misconduct include assault, drunkenness, stealing, bullying or serious breach of your employer's policies and practices
ga: Samplaí den mhí-iompar tromchúiseach ná ionsaí, meisce, gadaíocht, bulaíocht nó sárú ar bheartanna agus cleachtais an fhostóra

source: Your contract of employment may contain further information concerning gross misconduct
ga: D'fhéadfadh níos mó eolais a bheith i do chonradh fostaíochta maidir le mí-iompar tromchúiseach

source: Ordinary instances of misconduct may be a series of minor incidents which, when taken together, are enough to warrant dismissal, although your employer is obliged to give you notice or pay in lieu of notice in this type of situation
ga: Maidir leis na gnátheachtraí mí-iompair, d'fhéadfadh sraith mioneachtraí a bheith i gceist ach, nuair a chuirtear le chéile iad tugann sé údar ceart le dífhostú. Cibé, tá dualgas ar an bhfostóir fógra nó pá in áit fógra a thabhairt duit

source: Your employer will need to investigate each situation adequately to obtain all the facts of the case
ga: Caithfidh an fostóir gach cás a fhiosrú i gceart chun teacht ar na fíricí ar fad a bhaineann leis an gcás

source: Except in cases of gross misconduct, you must have been given appropriate warnings about your conduct and been made aware that dismissal might result if the problems continue
ga: Ach amháin i gcásanna mí-iompair thromchúisigh, tá sé riachtanach gur tugadh rabhaidh iomchuí duit faoi d'iompar agus gur léiríodh duit go raibh seans maith ann go mbeadh dífhostú mar thoradh ar an iompar sin dá leanfadh de na fadhbanna

source: If this has been done, the dismissal is fair, because you have been given a chance to improve your conduct
ga: Má cuireadh an méid sin i gcrích, tá an dífhostú cóir, mar tugadh an deis duit d'iompar a fheabhsú

source: The Workplace Relations Commission's Code of Practice: Grievance and Disciplinary Procedures states that employers should have written grievance and disciplinary procedures and they should give employees copies of these at the start of their employment
ga: D'fhoilisgh an Coimisiún um Chaidreamh san Áit Oibre Cód Cleachtais: Nósanna Imeachta Casaoide agus Araíonachta a shonraíonn gur chóir nósanna imeachta casaoide agus araíonachta a bheith ag fostóirí agus gur chóir dóibh cóipeanna díobh seo a thabhairt d'fhostaithe ag tús a gcuid fostaíochta

source: Under the unfair dismissals legislation employers are required to give the employee in written notice of the procedures to be followed before an employee is dismissed
ga: Faoi reactaíocht um dhífhostú éagórach tá dualgas ar fhostóirí fógra scríofa de na nósanna imeachta a leanfar a thabhairt d'fhostaí sula ndíbrítear fostaí óna p(h)ost

source: This must be done within 28 days of entering the contract of employment
ga: Caithfear é seo a dhéanamh laistigh de 28 lá ó chonradh fostaíochta a dhéanamh

source: In this case your employer will want to show that a redundancy situation exists and that therefore the dismissal is fair
ga: Sa chás seo beidh an fostóir ag iarraidh a thaispeáint go bhfuil cás iomarcaíochta ann agus mar sin de go bhfuil an dífhostú cóir

source: To counter this, you may present one or more of the following arguments: that there is no economic justification for the redundancy; that you have been replaced; or that you were unfairly selected for redundancy
ga: Chun é sin a bhréagnú, is féidir leat ceann nó níos mó ná ceann amháin de na hargóintí seo a dhéanamh: nach bhfuil aon bhunús eacnamaíoch leis an iomarcaíocht; gur fostaíodh duine eile i d'áit; gur roghnaíodh tú go héagórach don iomarcaíocht

source: Your employer may dismiss you if your continued employment would contravene the law
ga: Is féidir leis an bhfostóir tú a dhífostú dá sáródh buanú d'fhostaíochta riachtanas dlí eile

source: For example, you need a current driving licence to work, but you have lost your licence on a drunk driving charge
ga: Cuir i gcás go bhfuil ceadúnas tiomána reatha uait don bhfostaíocht, ach gur chaill tú do cheadúnas mar cúisíodh tú le bheith ag tiomáint agus tú ólta

source: You cannot continue to work without breaking the law and dismissal may be justified
ga: Ní féidir leat leanúint san obair gan an dlí a shárú agus féadann údar maith a bheith leis an dífhostú

source: However, your employer might be expected to look at alternatives depending on all the facts of the case
ga: D'fhéadfadh sé go mbeadh ar an bhfostóir féachaint ar roghanna eile, ag brath ar na fíricí ar fad a bhaineann leis an gcás

source: This category is designed to include any situations not covered above
ga: Díríonn an aicme seo ar aon chineál cás nach bhfuil clúdaithe thuas

source: Your employer will be required to establish that there were other substantial grounds and that they justify your dismissal
ga: Caithfidh an fostóir a chruthú go raibh cúiseanna substaintiúla eile agus go dtugann siad údar maith le dífhostú

source: Certain reasons for dismissal are considered to be automatically unfair
ga: Meastar go bhfuil cúiseanna áirithe do dhífhostú éagórach sa ghnáthchúrsa

source: • membership or proposed membership of a trade union or engaging in trade union activities, whether within permitted times during work or outside of working hours
ga: • ballraíocht ag an bhfostaí, nó tá ballraíocht a bheith ar intinn aige/aici, de cheardchumann nó gníomhaíocht in imeachtaí ceardchumainn,

source: • religious or political opinions
ga: • tuairimí creidimh nó polaitiúla

source: • legal proceedings against an employer where an employee is a party or a witness
ga: • imeachtaí dlíthiúla in aghaidh fostóra nuair atá an fostaí mar pháirtí nó finné

source: • race, colour, sexual orientation, age or membership of the Traveller community
ga: • cine, dath, claonadh gnéis,aois nó duine den Lucht Siúil

source: • pregnancy, giving birth or breastfeeding or any matters connected with pregnancy or birth
ga: • toircheas, saolú linbh nó tabhairt chun cíche nó aon rud a bhaineann le toircheas nó breith

source: • availing of rights under legislation such as maternity leave, adoptive leave, paternity leave, carer's leave, parental or force majeure leave
ga: • an fostaí a bheith i mbun nó ag beartú cearta faoin reachtaíocht a chur i ngníomh ar nós saoire mháithreachais, saoire altramais, saoire atharthachta, saoire cúramóra,saoire thuismitheora nó saoire force majeure

source: Note: employment equality legislation prohibits dismissal based on any of the following 9 grounds for discrimination: gender, civil status, family status, age, disability, religious belief, race, sexual orientation or membership of the Traveller community
ga: Nóta: faoin reachtaíocht comhionannais fostaíochta ní féidir le fostóir aon duine a roghnú ar son dífhostaithe ar aon cheann den naoi gcúis leatroma seo a leanas: gnéas, stádas sibhialta, stádas teaghlaigh, aois, míchumas, creideamh, cine, claonadh gnéis nó duine den Lucht Siúil

source: So, for example, if you have been employed for less than a year you may not be able to bring a claim under the unfair dismissals legislation, but it could be possible under equality legislation
ga: Mar sin, cuir i gcás go raibh tú fostaithe ar feadh níos lú ná bliain, d'fhéadfadh nach mbeifeá a bheith in ann éileamh a dhéanamh faoin reachtaíocht dífhostaithe éagóracha , ach d'fhéadfá é a dhéanamh faoi reachtaíocht comhionannais

source: When dismissal is being considered your employer is expected to have disciplinary procedures in place and to follow them
ga: Nuair atá dífhostú á mheas, ba cheart nósanna imeachta araíonachta a bheith i bhfeidhm ag an bhfostóir agus ba cheart dó/di cloí leo

source: Disciplinary procedures set out the stages and process the employer will follow in relation to alleged shortcomings of an employee
ga: Leagann nósanna imeachta araíonachta amach na céimeanna agus an próiseas a chloífidh an fostóir leo maidir le lochtanna líomhnaithe fostóra

source: Generally, the procedure allows for informal warnings leading to written warnings and ultimately to dismissal as described in the Code of Practice on grievance and disciplinary procedures
ga: Go ginearálta, ceadaíonn an nós imeachta rabhaidh neamhfhoirmiúla as a dtagann rabhaidh scríofa agus dhífhostú faoi dheireadh, mar a deirtear sa Chód Cleachtais ar nósanna imeachta casaoide agus araíonachta

source: Your employer must follow fair procedures and is required to give you appropriate warnings, make you fully aware of the allegations against you and give you an opportunity to present your side
ga: Caithfidh d'fhostóir cloí le nósanna imeachta cóir agus beidh air/uirthi rabhaidh chuí a thabhairt duit, tú a chur ar an eolas maidir le líomhaintí a dhéantar i do choinne agus deis a thabhairt duit do chás a thabhairt

source: You must also be allowed the right to be represented in any disciplinary procedures by, for example, your trade union official
ga: I nósanna imeachta araíonachta ar bith tá an ceart agat chun ionadaíochta ó, mar shampla, oifigeach do cheardchumainn

source: In deciding a case, the body hearing it must take into account the reasonableness or otherwise of your employer's conduct
ga: Nuair atá do chás á mheas, caithfidh an lucht éisteachta aird a thabhairt ar an gné réasúnta nó eile a bhain le hiompar an fhostóra

source: In addition, the question as to whether or not your employer had a dismissal procedure in place will also be taken into account
ga: Ina theannta sin, féachfar ar an gceist an raibh nó nach raibh nós imeachta dífhostaithe i bhfeidhm agus cuirfear é sin san áireamh chomh maith

source: If you wish to make a claim for unfair dismissal you should do so within 6 months of the date of dismissal
ga: Más mian leat éileamh a dhéanamh ar son dífhostaithe éagóraigh, ba chóir duit é a dhéanamh laistigh de 6 mhí tar éis dáta an dífhostaithe

source: This time limit may be extended to 12 months in cases if there was a reasonable cause for the delay
ga: Féadfar an teorainn ama seo a leathnú go dtí 12 mhí i gcásanna nach rabhthas in ann an t-éileamh a chur isteach laistigh de 6 mhí mar gheall ar chúinsí réasúnacha

source: If you qualify under the unfair dismissals legislation, you may bring your claim to the Workplace Relations Commission using the online complaint form available on workplacerelations.ie
ga: Má cháilíonn tú faoin reachtaíocht dífhostaithe éagóracha, is féidir leat an t-éileamh a thabhairt faoi bhráid an Choimisiúin um Chaidreamh san Áit Oibre tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: Complaints will be referred to an adjudication officer for hearing
ga: Cuirfear gearáin faoi bhráid breithneora an Choimisiúin um Chaidreamh san Áit Oibre i gcomhair éisteacht

source: All decisions of an adjudication officer can be appealed to the Labour Court
ga: Tá ceart achomhairc chuig an Chúirt Oibreachais tar éis cinnidh an bhreithneoir

source: For information in order to seek redress under the Acts contact the Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Le haghaidh tuilleadh faisnéise nó foirmeacha gearáin chun cúiteamh a lorg faoi na hAchtanna téigh i dteagmháil leis an tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre
